; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-2nodes-1000size-3degree-100mindistance-2trucks-9packages-1063seed

(define (problem transport-three-cities-sequential-2nodes-1000size-3degree-100mindistance-2trucks-9packages-1063seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  package-6 - package
  package-7 - package
  package-8 - package
  package-9 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 751,554 -> 203,156
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 68)
  ; 203,156 -> 751,554
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 68)
  ; 2411,770 -> 2932,880
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 54)
  ; 2932,880 -> 2411,770
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 54)
  ; 1627,2579 -> 1557,2838
  (road city-3-loc-2 city-3-loc-1)
  (= (road-length city-3-loc-2 city-3-loc-1) 27)
  ; 1557,2838 -> 1627,2579
  (road city-3-loc-1 city-3-loc-2)
  (= (road-length city-3-loc-1 city-3-loc-2) 27)
  ; 751,554 <-> 2411,770
  (road city-1-loc-2 city-2-loc-2)
  (= (road-length city-1-loc-2 city-2-loc-2) 168)
  (road city-2-loc-2 city-1-loc-2)
  (= (road-length city-2-loc-2 city-1-loc-2) 168)
  (road city-1-loc-2 city-3-loc-1)
  (= (road-length city-1-loc-2 city-3-loc-1) 221)
  (road city-3-loc-1 city-1-loc-2)
  (= (road-length city-3-loc-1 city-1-loc-2) 221)
  (road city-2-loc-2 city-3-loc-2)
  (= (road-length city-2-loc-2 city-3-loc-2) 168)
  (road city-3-loc-2 city-2-loc-2)
  (= (road-length city-3-loc-2 city-2-loc-2) 168)
  (at package-1 city-3-loc-1)
  (at package-2 city-3-loc-2)
  (at package-3 city-2-loc-2)
  (at package-4 city-3-loc-2)
  (at package-5 city-2-loc-1)
  (at package-6 city-3-loc-1)
  (at package-7 city-1-loc-1)
  (at package-8 city-2-loc-2)
  (at package-9 city-2-loc-2)
  (at truck-1 city-3-loc-2)
  (capacity truck-1 capacity-2)
  (at truck-2 city-3-loc-1)
  (capacity truck-2 capacity-2)
 )
 (:goal (and
  (at package-1 city-2-loc-1)
  (at package-2 city-1-loc-2)
  (at package-3 city-1-loc-2)
  (at package-4 city-2-loc-2)
  (at package-5 city-1-loc-1)
  (at package-6 city-1-loc-1)
  (at package-7 city-2-loc-1)
  (at package-8 city-3-loc-1)
  (at package-9 city-2-loc-1)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (pick-up truck-2 city-3-loc-1 package-6 capacity-1 capacity-2)
   deleted: (at package-6 city-3-loc-1) (capacity truck-2 capacity-2)
   added: (in package-6 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 9
2. (pick-up truck-2 city-3-loc-1 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-3-loc-1) (capacity truck-2 capacity-1)
   added: (in package-1 truck-2) (capacity truck-2 capacity-0)
   goals met: 0 of 9
3. (drive truck-2 city-3-loc-1 city-1-loc-2)
   deleted: (at truck-2 city-3-loc-1)
   added: (at truck-2 city-1-loc-2)
   goals met: 0 of 9
4. (drive truck-2 city-1-loc-2 city-1-loc-1)
   deleted: (at truck-2 city-1-loc-2)
   added: (at truck-2 city-1-loc-1)
   goals met: 0 of 9
5. (drop truck-2 city-1-loc-1 package-6 capacity-0 capacity-1)
   deleted: (in package-6 truck-2) (capacity truck-2 capacity-0)
   added: (at package-6 city-1-loc-1) (capacity truck-2 capacity-1)
   goals met: 1 of 9
6. (pick-up truck-2 city-1-loc-1 package-7 capacity-0 capacity-1)
   deleted: (at package-7 city-1-loc-1) (capacity truck-2 capacity-1)
   added: (in package-7 truck-2) (capacity truck-2 capacity-0)
   goals met: 1 of 9
7. (pick-up truck-1 city-3-loc-2 package-4 capacity-1 capacity-2)
   deleted: (at package-4 city-3-loc-2) (capacity truck-1 capacity-2)
   added: (in package-4 truck-1) (capacity truck-1 capacity-1)
   goals met: 1 of 9
8. (pick-up truck-1 city-3-loc-2 package-2 capacity-0 capacity-1)
   deleted: (at package-2 city-3-loc-2) (capacity truck-1 capacity-1)
   added: (in package-2 truck-1) (capacity truck-1 capacity-0)
   goals met: 1 of 9
9. (drive truck-1 city-3-loc-2 city-2-loc-2)
   deleted: (at truck-1 city-3-loc-2)
   added: (at truck-1 city-2-loc-2)
   goals met: 1 of 9
10. (drop truck-1 city-2-loc-2 package-4 capacity-0 capacity-1)
   deleted: (in package-4 truck-1) (capacity truck-1 capacity-0)
   added: (at package-4 city-2-loc-2) (capacity truck-1 capacity-1)
   goals met: 2 of 9
11. (pick-up truck-1 city-2-loc-2 package-9 capacity-0 capacity-1)
   deleted: (at package-9 city-2-loc-2) (capacity truck-1 capacity-1)
   added: (in package-9 truck-1) (capacity truck-1 capacity-0)
   goals met: 2 of 9
12. (drive truck-1 city-2-loc-2 city-2-loc-1)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-2-loc-1)
   goals met: 2 of 9
13. (drop truck-1 city-2-loc-1 package-9 capacity-0 capacity-1)
   deleted: (in package-9 truck-1) (capacity truck-1 capacity-0)
   added: (at package-9 city-2-loc-1) (capacity truck-1 capacity-1)
   goals met: 3 of 9
14. (pick-up truck-1 city-2-loc-1 package-5 capacity-0 capacity-1)
   deleted: (at package-5 city-2-loc-1) (capacity truck-1 capacity-1)
   added: (in package-5 truck-1) (capacity truck-1 capacity-0)
   goals met: 3 of 9
15. (drive truck-1 city-2-loc-1 city-2-loc-2)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-2-loc-2)
   goals met: 3 of 9
16. (drive truck-1 city-2-loc-2 city-1-loc-2)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-1-loc-2)
   goals met: 3 of 9
17. (drop truck-1 city-1-loc-2 package-2 capacity-0 capacity-1)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-0)
   added: (at package-2 city-1-loc-2) (capacity truck-1 capacity-1)
   goals met: 4 of 9
18. (drive truck-2 city-1-loc-1 city-1-loc-2)
   deleted: (at truck-2 city-1-loc-1)
   added: (at truck-2 city-1-loc-2)
   goals met: 4 of 9
19. (drive truck-1 city-1-loc-2 city-1-loc-1)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-1-loc-1)
   goals met: 4 of 9
20. (drive truck-2 city-1-loc-2 city-2-loc-2)
   deleted: (at truck-2 city-1-loc-2)
   added: (at truck-2 city-2-loc-2)
   goals met: 4 of 9
21. (drive truck-2 city-2-loc-2 city-2-loc-1)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-2-loc-1)
   goals met: 4 of 9
22. (drop truck-1 city-1-loc-1 package-5 capacity-1 capacity-2)
   deleted: (in package-5 truck-1) (capacity truck-1 capacity-1)
   added: (at package-5 city-1-loc-1) (capacity truck-1 capacity-2)
   goals met: 5 of 9
23. (drop truck-2 city-2-loc-1 package-1 capacity-0 capacity-1)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-0)
   added: (at package-1 city-2-loc-1) (capacity truck-2 capacity-1)
   goals met: 6 of 9
24. (drop truck-2 city-2-loc-1 package-7 capacity-1 capacity-2)
   deleted: (in package-7 truck-2) (capacity truck-2 capacity-1)
   added: (at package-7 city-2-loc-1) (capacity truck-2 capacity-2)
   goals met: 7 of 9
25. (drive truck-2 city-2-loc-1 city-2-loc-2)
   deleted: (at truck-2 city-2-loc-1)
   added: (at truck-2 city-2-loc-2)
   goals met: 7 of 9
26. (pick-up truck-2 city-2-loc-2 package-3 capacity-1 capacity-2)
   deleted: (at package-3 city-2-loc-2) (capacity truck-2 capacity-2)
   added: (in package-3 truck-2) (capacity truck-2 capacity-1)
   goals met: 7 of 9
27. (pick-up truck-2 city-2-loc-2 package-8 capacity-0 capacity-1)
   deleted: (at package-8 city-2-loc-2) (capacity truck-2 capacity-1)
   added: (in package-8 truck-2) (capacity truck-2 capacity-0)
   goals met: 7 of 9
28. (drive truck-2 city-2-loc-2 city-1-loc-2)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-1-loc-2)
   goals met: 7 of 9
29. (drop truck-2 city-1-loc-2 package-3 capacity-0 capacity-1)
   deleted: (in package-3 truck-2) (capacity truck-2 capacity-0)
   added: (at package-3 city-1-loc-2) (capacity truck-2 capacity-1)
   goals met: 8 of 9
30. (drive truck-2 city-1-loc-2 city-3-loc-1)
   deleted: (at truck-2 city-1-loc-2)
   added: (at truck-2 city-3-loc-1)
   goals met: 8 of 9
31. (drop truck-2 city-3-loc-1 package-8 capacity-1 capacity-2)
   deleted: (in package-8 truck-2) (capacity truck-2 capacity-1)
   added: (at package-8 city-3-loc-1) (capacity truck-2 capacity-2)
   goals met: 9 of 9
